Realizada a importação das libs necessárias para o desemvolvimento do projeto.

In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt
import seaborn as sns

Realiza o carregamento do arquivo a ser trabalhado no projeto.

In [2]:
df_titanic = pd.read_csv('titanic-data-6.csv')
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Verificando os valores

In [28]:
df_male = df_titanic.query('Sex == "male"')
df_female = df_titanic.query('Sex == "female"')

In [43]:
df_titanic.query('Sex == "male" and SibSp == "0" and Survived == "1" and Parch == "0"').shape[0]

64

In [4]:
df_titanic.query('Sex == "female" and SibSp == "0" and Survived == "1" and Parch == "0"').shape[0]

99

In [34]:
df_male.head()
df_male.shape[0]

577

In [35]:
df_female.head()
df_female.shape[0]

314

In [13]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [14]:
def change_null_value(df, columm, value):
    return df[columm].fillna(value, inplace=True)

Pudemos perceber que os campos `Age`, `Cabin` e `Embarked` possuem valores nulos.

Tratando os valores nulos.

In [15]:
# Tratando os valores de Age.
age_means = df_titanic['Age'].mean()
change_null_value(df_titanic, 'Age', age_means)

# Tratando os valores de Cabin.
change_null_value(df_titanic, 'Cabin', 'Uninformed')

# Tratando os valores de Embarked.
change_null_value(df_titanic, 'Embarked', 'Uninformed')

# Verifica se todos os valores nulos foram substituidos.
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          891 non-null object
Embarked       891 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

Verifica se existem dados duplicados

In [7]:
if sum(df_titanic.duplicated())

0

Converte a coluna `Age` do tipo **float** para **int**.

In [8]:
df_titanic['Age'] = df_titanic['Age'].astype(int)

In [11]:
df_titanic.dtypes
df_titanic.head()

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age              int32
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [10]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            891 non-null int32
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          891 non-null object
Embarked       891 non-null object
dtypes: float64(1), int32(1), int64(5), object(5)
memory usage: 80.1+ KB